railsbridge-tron/app/controllers/votes_controller.rb

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "votes" ("created_at", "topic_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 03 Nov 2012 21:46:04 UTC +00:00], ["topic_id", 1], ["updated_at", Sat, 03 Nov 2012 21:46:04 UTC +00:00]]
---
	  def create
    topic = Topic.find(params[:topic_id])
    vote = topic.votes.build
    vote.save!